УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/КонтурЗакупки_ПоискЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ПоискЗакупок</name>
  <attributes>
    <name>Авансирование223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Авансирование44</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗакупкиБезНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленныеИсключенныеЗаказчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейНаСтраницу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреимуществаСМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораВсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораДругиеСпособы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗакупкаУЕдинственногоПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросИлиМониторингЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросКотировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораКонкурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЭлектронныйАукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов44ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов615ПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческиеИМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочныйПоиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЗавершены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОтменены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПланируются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодачаЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапРаботаКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапТолькоНесостоявшиеся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоиска</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоТекущейДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРегламентномЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗагрузкуЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоискаОффлайн</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакупкиНаЗагрузку</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отрасли</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_Отрасли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтраслиОбновленные</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_ОтраслиОбновленные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Площадки</name>
    <attributes>
      <name>Площадка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлощадки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРегиона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПоиска</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗакупкиНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗакупки</name>
      <type>
        <types>EnumRef.КонтурЗакупки_ТипыЗакупки</types>
      </type>
    </attributes>
    <attributes>
      <name>НМЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаКЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПодачиЗаявок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаОтменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПубликации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЗагруженный</name>
      <type>
        <types>DocumentRef.КонтурЗакупки_Закупка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННЗаказчиковИОрганизаторов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МестаПоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сниппеты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СниппетыДляОтображения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Участники</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодведенияИтогов</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаНеСостоялась</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаПланируется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникиКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сниппеты</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сниппет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/Forms/Форма/Module.bsl
#Область ОписаниеПеременных
//@skip-check bsl-variable-name-invalid
&НаКлиенте
Перем гСоответствиеПолейСправочникаКонтрагенты;
//@skip-check bsl-variable-name-invalid
&НаКлиенте
Перем гНаименованиеСправочникаКонтрагенты; // Строка

&НаКлиенте
Перем гПоискСвернут; // Булево

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ТекстПредупрежденияИВопроса = НСтр("ru = 'Данные шаблона были изменены. Закрыть?'");
	Если ЗначениеЗаполнено(ЗавершениеРаботы) Тогда
		Если Модифицированность И ЗначениеЗаполнено(Объект.ШаблонПоиска) Тогда

			КнопкиВопроса = Новый СписокЗначений;
			КнопкиВопроса.Добавить("СохранитьИЗакрыть", "Сохранить и закрыть");
			КнопкиВопроса.Добавить("ЗакрытьБезСохранения", "Закрыть без сохранения");
			КнопкиВопроса.Добавить("НеЗакрывать", "Не закрывать");

			Отказ = Истина;
			ОбратныйВызов = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма);
			ПоказатьВопрос(ОбратныйВызов, ТекстПредупрежденияИВопроса, КнопкиВопроса, , "НеЗакрывать");
		КонецЕсли;
	Иначе
		Если Модифицированность И ЗначениеЗаполнено(Объект.ШаблонПоиска) Тогда
			Отказ = Истина;
			ТекстПредупреждения = ТекстПредупрежденияИВопроса;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если КонтурЗакупки_СлужебныеВызовСервера.РежимСовместимости82() Тогда
//		ДекорацияРастяжитель = Элементы.Добавить("ДекорацияРастяжитель1", Тип(
//					"ДекорацияФормы"), Элементы.СтраницаПоиск);
//		ДекорацияРастяжитель.Вид = ВидДекорацииФормы.Картинка;
//		ДекорацияРастяжитель.РастягиватьПоВертикали = Истина;
//
//		ДекорацияРастяжитель = Элементы.Добавить("ДекорацияРастяжитель", Тип(
//					"ДекорацияФормы"), Элементы.СтраницаРезультатыПоиска);
//		ДекорацияРастяжитель.Вид = ВидДекорацииФормы.Картинка;
//		ДекорацияРастяжитель.РастягиватьПоВертикали = Истина;
//	КонецЕсли;

	СтарыйСправочникОтраслей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"СтарыйСправочникОтраслей", Ложь);

	Элементы.НадписьОтрасли.Видимость = СтарыйСправочникОтраслей;
	Элементы.НадписьОтраслиОбновленные.Видимость = Не СтарыйСправочникОтраслей;

	Объект.КонецПериода = ТекущаяДатаСеанса();
	Если ЗначениеЗаполнено(Параметры.ШаблонПоиска) Тогда
		Объект.ШаблонПоиска = Параметры.ШаблонПоиска;
		//ОкончниеВыбораШаблонаНаСервере();
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ЗаполнитьПоискПоШаблону();
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Иначе
		Объект.НачалоПериода = КонтурЗакупки_СлужебныеКлиентСервер.ДобавитьДней(ТекущаяДатаСеанса(), -7);

		НачальноеЗаполнениеПризнаков();

	КонецЕсли;
	Объект.КонецПериодаОффлайн = ТекущаяДатаСеанса();
	Объект.НачалоПериодаОффлайн = КонтурЗакупки_СлужебныеКлиентСервер.ДобавитьДней(ТекущаяДатаСеанса(), -7);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНадписьКоличестваЗаказчиков();
	ОбновитьНадписьКоличестваОтраслей();
	ОбновитьНадписьКоличестваПлощадок();
	ОбновитьНадписьКоличестваРегионов();
	ИзменениеФлагТолькоНесостоявшиесяНаКлиенте();
	ИзменениеФлагТолькоЗавершеныНаКлиенте();
	гНаименованиеСправочникаКонтрагенты = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаКонтрагентов", "Контрагенты");

	//@skip-check bsl-variable-name-invalid
	гСоответствиеПолейСправочникаКонтрагенты = Новый Структура;
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("Наименование", "Наименование");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("ИНН", "ИНН");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("ОГРН", "РегистрационныйНомер");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("Адрес", "");

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка." + гНаименованиеСправочникаКонтрагенты) Тогда
			ДобавитьЗаказчикаНаКлиенте(ВыбранноеЗначение);
			ОбновитьНадписьКоличестваЗаказчиков();
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ЭлМассива Из ВыбранноеЗначение Цикл
				Если ТипЗнч(ЭлМассива) = Тип("СправочникСсылка." + гНаименованиеСправочникаКонтрагенты) Тогда
					ДобавитьЗаказчикаНаКлиенте(ЭлМассива);
				КонецЕсли;
			КонецЦикла;
			ОбновитьНадписьКоличестваЗаказчиков();
		КонецЕсли;
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьРегионыПоставкиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОповещениеОЗакрытииРегионов = Новый ОписаниеОповещения("ВыборРегиона", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ТаблицаРегионов", ПолучитьТЗРегионов());

	ОткрытьФорму(
			"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораРегиона", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииРегионов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НадписьОтраслиОбновленныеНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборОтраслиОбновленные", ЭтаФорма);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтраслиОбновленные", Объект.ОтраслиОбновленные);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Открытьформу("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораОтраслиОбновленные", ПараметрыФормы, ЭтаФорма,
		, , , ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НадписьОтраслиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборОтрасли", ЭтаФорма);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отрасли", Объект.Отрасли);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Открытьформу("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораОтрасли", ПараметрыФормы, ЭтаФорма, , , ,
		ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НадписьПлощадкиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОповещениеОЗакрытииПлощадок = Новый ОписаниеОповещения("ВыборПлощадки", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ТаблицаПлощадок", ПолучитьТЗПлощадок());

	ОткрытьФорму(
			"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораПлощадок", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииПлощадок, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НадписьЗаказчикиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОповещениеОЗакрытииДобавленных = Новый ОписаниеОповещения("ВыборЗаказчика", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ЗаказчикиВыбранные", ПолучитьТЗЗаказчиков());
	СтрукПараметры.Вставить("ЗаказчикиВРежимеИсключения", Объект.ДобавленныеИсключенныеЗаказчики);
	ОткрытьФорму(
			"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораЗаказчиков", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииДобавленных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
&НаКлиенте
Процедура ШаблонПоискаПриИзменении(Элемент)
	ИзменениеШаблонаПоиска();
КонецПроцедуры
&НаКлиенте
Процедура НачальнаяЦенаДоПриИзменении(Элемент)
	НачальнаяЦенаДоПриИзмененииНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяЦенаОтПриИзменении(Элемент)
	НачальнаяЦенаОтПриИзмененииНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтраницаТекущаяПриИзменении(Элемент)
	Объект.СтраницаТекущая = Мин(Макс(Объект.СтраницаТекущая, 1), Объект.СтраницВсего);
	НайтиЗакупкиНаКлиенте(Объект.СтраницаТекущая);
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяВРегламентномЗаданииПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейДоТекущейДатыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеСловаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПодачаЗаявокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапРаботаКомиссииПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПланируютсяПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапЗавершеныПриИзменении(Элемент)
	ИзменениеФлагТолькоЗавершеныНаКлиенте();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапТолькоНесостоявшиесяПриИзменении(Элемент)
	ИзменениеФлагТолькоНесостоявшиесяНаКлиенте();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапОтмененыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипТоргов44ФЗПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипТоргов223ФЗПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипТорговКоммерческиеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипТоргов615ПППриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавленныеИсключенныеЗаказчикиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораЗапросКотировокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораКонкурсПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораЗакупкаУЕдинственногоПоставщикаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораЗапросИлиМониторингЦенПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораДругиеСпособыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораЭлектронныйАукционПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВключатьЗакупкиБезНМЦПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Авансирование44ПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Авансирование223ПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПреимуществаСМППриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакСоставитьПоисковыйЗапросНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения, "https://zakupki.kontur.ru/site/instructions/beginner/search");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоискПоДокументацииНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения, "https://zakupki.kontur.ru/site/instructions/beginner/doc-search");
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПоискаОффлайнПриИзменении(Элемент)
	ИзменениеШаблонаПоиска();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПоискаОффлайнОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПоискаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СвернутьПоиск(ТекущаяСтраница);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗакупок

&НаКлиенте
Процедура ТаблицаЗакупокПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент = Элементы.ТаблицаЗакупокНазваниеЗакупки Тогда
		Отказ = Истина;
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			Если Элемент.ТекущиеДанные.Загружен Тогда
				ПоказатьЗначение( , Элемент.ТекущиеДанные.СсылкаНаЗагруженный);
			Иначе
				ОповещениеОкончанияВопросаОЗагрузке = Новый ОписаниеОповещения("ОповещениеОкончанияВопросаОЗагрузке",
					ЭтаФорма, Элемент.ТекущиеДанные.ИдентификаторЗакупки);
				ПоказатьВопрос(ОповещениеОкончанияВопросаОЗагрузке, СтрШаблон(НСтр(
						"ru = 'Загрузить закупку с идентификатором %1'"), Элемент.ТекущиеДанные.ИдентификаторЗакупки),
					РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, НСтр("ru = 'Загрузить закупку?'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗакупокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗакупокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповещениеОбЗапуске = Новый ОписаниеОповещения;
	Если Поле = Элементы.ТаблицаЗакупокСсылкаНаЭТП И Не ПустаяСтрока(Элемент.ТекущиеДанные.СсылкаНаЭТП) Тогда
		НачатьЗапускПриложения(ОповещениеОбЗапуске, Элемент.ТекущиеДанные.СсылкаНаЭТП);
	ИначеЕсли Поле = Элементы.ТаблицаЗакупокСсылкаНаКЗ И Не ПустаяСтрока(Элемент.ТекущиеДанные.СсылкаНаКЗ) Тогда
		НачатьЗапускПриложения(ОповещениеОбЗапуске, Элемент.ТекущиеДанные.СсылкаНаКЗ);
	ИначеЕсли Поле = Элементы.ТаблицаЗакупокСсылкаНаЗагруженный Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.СсылкаНаЗагруженный);
	ИначеЕсли Поле = Элементы.ТаблицаЗакупокУчастникиКоличество Тогда
		ПоказатьУчастников(Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаЗакупокЗагружатьПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ТаблицаЗакупок.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ЗагружатьПриИзмененииНаСервере(ИДТекущейСтроки);
		ОбновитьНадписьКнопкиЗагрузитьЗакупки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗакупокПриАктивизацииСтроки(Элемент)
	Если Не Элементы.ТаблицаЗакупок.ТекущиеДанные = Неопределено Тогда
		МассивСтрок = Новый Массив;
		СимволыНачало = "[b]";
		СимволыКонец = "[/b]";

		СтрокаСниппеты = Элементы.ТаблицаЗакупок.ТекущиеДанные.Сниппеты;
		КоличествоЖирных = СтрЧислоВхождений(СтрокаСниппеты, СимволыНачало);
		Для Инд = 1 По КоличествоЖирных Цикл

			НомСимвола = СтрНайти(СтрокаСниппеты, СимволыНачало);
			МассивСтрок.Добавить(Лев(СтрокаСниппеты, НомСимвола - 1));
			СтрокаСниппеты = Сред(СтрокаСниппеты, НомСимвола + СтрДлина(СимволыНачало));

			НомСимвола = СтрНайти(СтрокаСниппеты, СимволыКонец);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Лев(СтрокаСниппеты, НомСимвола - 1), Новый Шрифт(, ,
				Истина)));
			СтрокаСниппеты = Сред(СтрокаСниппеты, НомСимвола + СтрДлина(СимволыКонец));

		КонецЦикла;
		МассивСтрок.Добавить(СтрокаСниппеты);

		Сниппеты = Новый ФорматированнаяСтрока(МассивСтрок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗакупокОбработкаЗапросаОбновления(Элемент)
	ОбновитьПризнакиЗагрузкиИСсылкиФорма();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЭтапыУстановитьПометки(Команда)

	ЭтапыПометки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСнятьПометки(Команда)

	ЭтапыПометки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТипыТорговУстановитьПометки(Команда)

	ТипыТорговПометки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТипыТорговСнятьПометки(Команда)

	ТипыТорговПометки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораСнятьПометки(Команда)

	СпособОтбораПометки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораУстановитьПометки(Команда)

	СпособОтбораПометки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиОчистить(Команда)
	ЗаказчикиОчиститьНаСервере();
	ОбновитьНадписьКоличестваЗаказчиков();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	ДиалогВыбораПериода  = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогВыбораПериода.Период.ДатаНачала = Объект.НачалоПериода;
	ДиалогВыбораПериода.Период.ДатаОкончания = Объект.КонецПериода;
	ОповеститьОВыбореПериода = Новый ОписаниеОповещения("ОкончаниеВыбораПериода", ЭтаФорма);
	ДиалогВыбораПериода.Показать(ОповеститьОВыбореПериода);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодОффлайн(Команда)
	ДиалогВыбораПериода  = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогВыбораПериода.Период.ДатаНачала = Объект.НачалоПериодаОффлайн;
	ДиалогВыбораПериода.Период.ДатаОкончания = Объект.КонецПериодаОффлайн;
	ОповеститьОВыбореПериода = Новый ОписаниеОповещения("ОкончаниеВыбораПериодаОффлайн", ЭтаФорма);
	ДиалогВыбораПериода.Показать(ОповеститьОВыбореПериода);
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗакупки(Команда)
	Результат = НайтиЗакупкиНаКлиенте();

	Если Результат Тогда
		ОбновитьОтображениеДанных();
		ТекущийЭлемент = Элементы.СтраницаРезультатыПоиска;
		СвернутьПоиск(Элементы.СтраницаРезультатыПоиска);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗакупкиОффлайн(Команда)
	ОффлайнПоискНаСервере();
	ОбновитьОтображениеДанных();
	ТекущийЭлемент = Элементы.СтраницаРезультатыПоиска;
	СвернутьПоиск(Элементы.СтраницаРезультатыПоиска);
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПервая(Команда)
	Если Не Объект.СтраницаТекущая = 1 Тогда
		Объект.СтраницаТекущая = 1;
		НайтиЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамСледующая(Команда)
	Если Не Объект.СтраницаТекущая = Мин(Объект.СтраницаТекущая + 1, Объект.СтраницВсего) Тогда
		Объект.СтраницаТекущая = Мин(Объект.СтраницаТекущая + 1, Объект.СтраницВсего);
		НайтиЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПредыдущая(Команда)
	Если Не Объект.СтраницаТекущая = Макс(Объект.СтраницаТекущая - 1, 1) Тогда
		Объект.СтраницаТекущая = Макс(Объект.СтраницаТекущая - 1, 1);
		НайтиЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПоследняя(Команда)
	Если Не Объект.СтраницаТекущая = Объект.СтраницВсего Тогда
		Объект.СтраницаТекущая = Объект.СтраницВсего;
		НайтиЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗакупкиНеЗагруженные(Команда)
	ОтметитьЗакупкиНеЗагруженныеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗакупкиВсе(Команда)
	ОтметитьЗакупкиВсеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиЗакупкиВсе(Команда)
	СнятьОтметкиЗакупкиВсеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоказатьТолькоНеЗагруженные(Команда)
	Элементы.ТаблицаЗакупок.ОтборСтрок = Новый ФиксированнаяСтруктура("Загружен", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоказатьТолькоЗагруженные(Команда)
	Элементы.ТаблицаЗакупок.ОтборСтрок = Новый ФиксированнаяСтруктура("Загружен", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиДобавитьИзКонфигурации(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ИмяКонфигурации1С = КонтурЗакупки_СлужебныеВызовСервера.ИмяКонфигурации1С();
	Если ИмяКонфигурации1С = "УТ" Или ИмяКонфигурации1С = "БСП" Тогда
		ОткрытьФорму(
		"Справочник." + гНаименованиеСправочникаКонтрагенты + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму(
		"Справочник." + гНаименованиеСправочникаКонтрагенты + ".ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоказатьВсе(Команда)
	Элементы.ТаблицаЗакупок.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупки(Команда)
	ЗагрузитьЗакупкиПоСпискуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныСохранить(Команда)
	ШаблоныСохранитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОтрасли(Команда)

	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборОтрасли", ЭтаФорма);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отрасли", Объект.Отрасли);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Открытьформу("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораОтрасли", ПараметрыФормы, ЭтаФорма, , , ,
		ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
&НаКлиенте
Процедура РедактироватьОтраслиОбновленные(Команда)

	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборОтраслиОбновленные", ЭтаФорма);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтраслиОбновленные", Объект.ОтраслиОбновленные);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Открытьформу("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораОтраслиОбновленные", ПараметрыФормы, ЭтаФорма,
		, , , ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
&НаКлиенте
Процедура РедактироватьЗаказчики(Команда)
	ОповещениеОЗакрытииДобавленных = Новый ОписаниеОповещения("ВыборЗаказчика", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ЗаказчикиВыбранные", ПолучитьТЗЗаказчиков());
	ОткрытьФорму(
		"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораЗаказчиков", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииДобавленных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура РедактироватьПлощадки(Команда)
	ОповещениеОЗакрытииПлощадок = Новый ОписаниеОповещения("ВыборПлощадки", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ТаблицаПлощадок", ПолучитьТЗПлощадок());

	ОткрытьФорму(
		"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораПлощадок", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииПлощадок, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьРегионы(Команда)
	ОповещениеОЗакрытииРегионов = Новый ОписаниеОповещения("ВыборРегиона", ЭтаФорма);

	СтрукПараметры = Новый Структура;
	СтрукПараметры.Вставить("ТаблицаРегионов", ПолучитьТЗРегионов());

	ОткрытьФорму(
		"Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаВыбораРегиона", СтрукПараметры, ЭтаФорма, , , ,
		ОповещениеОЗакрытииРегионов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЭтапыПометки(Пометка)

	Объект.ЭтапПодачаЗаявок = Пометка;
	Объект.ЭтапРаботаКомиссии = Пометка;
	Объект.ЭтапЗавершены = Пометка;
	ИзменениеФлагТолькоЗавершеныНаКлиенте();
//	Объект.ЭтапТолькоНесостоявшиеся = Пометка;
	Объект.ЭтапПланируются = Пометка;
	Объект.ЭтапОтменены = Пометка;

	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипыТорговПометки(Пометка)

	Объект.ТипТоргов44ФЗ = Пометка;
	Объект.ТипТоргов223ФЗ = Пометка;
	Объект.ТипТорговКоммерческиеИМалые = Пометка;
	Объект.ТипТоргов615ПП = Пометка;
	Объект.ТипТорговКоммерческие = Пометка;
	Объект.ТипТорговМалые = Пометка;

	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтбораПометки(Пометка)

	Объект.СпособОтбораЗапросКотировок = Пометка;
	Объект.СпособОтбораКонкурс = Пометка;
	Объект.СпособОтбораЗакупкаУЕдинственногоПоставщика = Пометка;
	Объект.СпособОтбораЗапросИлиМониторингЦен = Пометка;
	Объект.СпособОтбораДругиеСпособы = Пометка;
	Объект.СпособОтбораЭлектронныйАукцион = Пометка;

	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоиск(ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаПоиск Тогда
		Если гПоискСвернут = Истина Тогда
			Элементы.ГруппаНастройкиПоиска.Скрыть();
		Иначе
			Элементы.ГруппаНастройкиПоиска.Показать();
		КонецЕсли;
	Иначе
		гПоискСвернут = Элементы.ГруппаНастройкиПоиска.Скрыта();
		Элементы.ГруппаНастройкиПоиска.Скрыть();
	КонецЕсли;
КонецПроцедуры

// Показать участников.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыКоллекция - Данные строки
&НаКлиенте
Процедура ПоказатьУчастников(ДанныеСтроки)
	Если ДанныеСтроки.УчастникиКоличество > 0 Тогда
		ПараметрыФормы = Новый Структура;
		Параметрыформы.Вставить("СтрокаМассивСтруктурУчастники", ДанныеСтроки.Участники);
		ОткрытьФорму("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.ФормаУчастников", ПараметрыФормы, ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаказчикаНаКлиенте(ВыбранноеЗначение)
	ДобавлятьЗаказчика = Истина;

	Если ДобавлятьЗаказчика Тогда
			// проверяем обязательно ИНН
		ИНН = ПолучитьИНННаСервере(ВыбранноеЗначение, гСоответствиеПолейСправочникаКонтрагенты["ИНН"]);
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			ДобавлятьЗаказчика = Ложь;
			КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(
					"ru = 'У контрагента не заполнено обязательное поле ИНН'"));
		КонецЕсли;
	КонецЕсли;

	Если ДобавлятьЗаказчика Тогда
		// Ищем в имеющихся по ИНН
		Если ЗаказчикЕстьВВыбранных(ИНН) Тогда
			ДобавлятьЗаказчика = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ДобавлятьЗаказчика Тогда
		ДобавитьЗаказчикаНаСервере(ВыбранноеЗначение, гСоответствиеПолейСправочникаКонтрагенты);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораПериода(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	Если Не ВыбранныйПериод = Неопределено Тогда
		Объект.НачалоПериода = ВыбранныйПериод.ДатаНачала;
		Объект.КонецПериода = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораПериодаОффлайн(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	Если Не ВыбранныйПериод = Неопределено Тогда
		Объект.НачалоПериодаОффлайн = ВыбранныйПериод.ДатаНачала;
		Объект.КонецПериодаОффлайн = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = "ЗакрытьБезСохранения" Тогда
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = "СохранитьИЗакрыть" Тогда
		ШаблоныСохранитьНаСервере();
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция НайтиЗакупкиНаКлиентеФорма(СтраницаЗначение, ОписаниеРезультата = "")
	Результат = Истина;
	ОчиститьТабличнаяЧастьРезультатыПоиска();//РезультатыПоиска.Очистить();

	СтруктураПоиска = ПолучитьСтруктуруПоискаФорма(СтраницаЗначение);

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьДанныеПоиска(СтруктураПоиска);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеПоиска = РезультатHTTPЗапроса["data"];
			ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеПоиска);
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат
КонецФункции

&НаСервере
Процедура ОффлайнПоискНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.НайтиЗакупкиОффлайн();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Функция НайтиЗакупкиНаКлиенте(СтраницаЗначение = 1)
	Результат = Истина;
	ОписаниеРезультата = "";
	Результат = НайтиЗакупкиНаКлиентеФорма(СтраницаЗначение, ОписаниеРезультата);

	Если Не Результат Тогда
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;

	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПоискаФорма(СтраницаЗначение = 1)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьСтруктуруПоиска(СтраницаЗначение);
КонецФункции

&НаСервере
Процедура ОчиститьТабличнаяЧастьРезультатыПоиска()
	Объект.РезультатыПоиска.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеПоиска)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТабличнуюЧастьРезультата(ДанныеПоиска);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаказчикаНаСервере(ВыбранныйЗаказчик, СоответствиеПолейСправочникаКонтрагенты)
	СтрокаЗаказчик = Объект.Заказчики.Добавить();
	Для Каждого ПолеСправочникеКонтрагенты Из СоответствиеПолейСправочникаКонтрагенты Цикл
		Если Не ПустаяСтрока(ПолеСправочникеКонтрагенты.Значение) Тогда
			Попытка
				СтрокаЗаказчик[ПолеСправочникеКонтрагенты.Ключ] = ВыбранныйЗаказчик[ПолеСправочникеКонтрагенты.Значение];
			Исключение
				;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьИНННаСервере(ВыбранныйЗаказчик, ПолеИНН)
	ИНН = "";
	ИНН = ВыбранныйЗаказчик[ПолеИНН];
	Возврат ИНН
КонецФункции

#Область Отрасли

&НаКлиенте
Процедура ВыборОтрасли(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		ВыборОтраслиНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
		ОбновитьНадписьКоличестваОтраслей();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборОтраслиНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	ТЗОтраслей = РезультатЗакрытия.Выгрузить();
	ТЗОтраслей.Свернуть("Отрасль");
	Объект.Отрасли.Загрузить(ТЗОтраслей);
КонецПроцедуры

&НаКлиенте
Процедура ВыборОтраслиОбновленные(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		ВыборОтраслиОбновленныеНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
		ОбновитьНадписьКоличестваОтраслей();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборОтраслиОбновленныеНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	ТЗОтраслей = РезультатЗакрытия.Выгрузить();
	ТЗОтраслей.Свернуть("Отрасль");
	Объект.ОтраслиОбновленные.Загрузить(ТЗОтраслей);
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоОтраслей()
	Возврат Объект.Отрасли.Количество();
КонецФункции

&НаСервере
Функция ПолучитьКоличествоОтраслейОбновленных()
	Возврат Объект.ОтраслиОбновленные.Количество();
КонецФункции

&НаСервере
Функция ПредставлениеОтраслей()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.Отрасли Цикл
		Результат = Результат + СтрокаТЗ.Отрасль + "; ";
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Функция ПредставлениеОтраслейОбновленных()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.ОтраслиОбновленные Цикл
		Результат = Результат + СтрокаТЗ.Отрасль + "; ";
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьКоличестваОтраслей()

	КоличествоВыделенныхОтраслей = ПолучитьКоличествоОтраслей();
	//Элементы.РедактироватьОтрасли.Заголовок = "Отрасли (устар.)" + ?(КоличествоВыделенныхОтраслей > 0, " ["
	//	+ КоличествоВыделенныхОтраслей + "]", " (все)");
	НадписьОтрасли = ?(КоличествоВыделенныхОтраслей > 0, Лев(СтрШаблон("(%1) %2", КоличествоВыделенныхОтраслей,
		ПредставлениеОтраслей()), 140), "все отрасли");

	КоличествоВыделенныхОтраслей = ПолучитьКоличествоОтраслейОбновленных();
	//Элементы.РедактироватьОтраслиОбновленные.Заголовок = "Отрасли" + ?(КоличествоВыделенныхОтраслей > 0, " ["
	//	+ КоличествоВыделенныхОтраслей + "]", " (все)");
	НадписьОтраслиОбновленные = ?(КоличествоВыделенныхОтраслей > 0, Лев(СтрШаблон("(%1) %2",
		КоличествоВыделенныхОтраслей, ПредставлениеОтраслейОбновленных()), 140), "все отрасли");

КонецПроцедуры

#КонецОбласти

#Область Регионы

&НаКлиенте
Процедура ВыборРегиона(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		ВыборРегионаНаСервере(РезультатЗакрытия);
		ОбновитьНадписьКоличестваРегионов();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборРегионаНаСервере(ТаблицаРегионов)
	Объект.Регионы.Очистить();
	Для Каждого СтрокаТЧ Из ТаблицаРегионов Цикл
		НовСтр = Объект.Регионы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗРегионов()
	Возврат КонтурЗакупки_ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Регионы.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьКоличестваРегионов()

	КоличествоРегионов = ПолучитьКоличествоРегионовНаСервере();
	//Элементы.РедактироватьРегионы.Заголовок = ?(КоличествоРегионов > 0, "выбрано регионов - " + КоличествоРегионов, "все регионы");      
	НадписьРегионыПоставки = ?(КоличествоРегионов > 0, Лев(СтрШаблон("(%1) %2", КоличествоРегионов,
		ПредставлениеРегионы()), 140), "все регионы");

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоРегионовНаСервере()
	Возврат Объект.Регионы.Количество();
КонецФункции

&НаСервере
Функция ПредставлениеРегионы()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.Регионы Цикл
		Результат = Результат + СтрокаТЗ.Регион + "; ";
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Этапы

&НаКлиенте
Процедура ИзменениеФлагТолькоНесостоявшиесяНаКлиенте()
	Если Объект.ЭтапТолькоНесостоявшиеся Тогда
		Объект.ЭтапЗавершены = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФлагТолькоЗавершеныНаКлиенте()
	Если Не Объект.ЭтапЗавершены Тогда
		Объект.ЭтапТолькоНесостоявшиеся = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Заказчики

&НаСервере
Функция ПолучитьТЗЗаказчиков()
	Возврат КонтурЗакупки_ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Заказчики.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ВыборЗаказчика(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		Объект.ДобавленныеИсключенныеЗаказчики = РезультатЗакрытия.ЗаказчикиВРежимеИсключения;
		ВыборЗаказчикаНаСервере(РезультатЗакрытия.ЗаказчикиВыбранные);
		ОбновитьНадписьКоличестваЗаказчиков();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборЗаказчикаНаСервере(ТаблицаЗаказчиков)
	Объект.Заказчики.Очистить();
	Для Каждого СтрокаТЧ Из ТаблицаЗаказчиков Цикл
		НовСтр = Объект.Заказчики.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьКоличестваЗаказчиков()

	КоличествоЗаказчиков = ПолучитьКоличествоЗаказчиковНаСервере();
	//Элементы.РедактироватьЗаказчики.Заголовок = "Заказчики" + ?(КоличествоЗаказчиков > 0, " [" + КоличествоЗаказчиков
	//	+ "]", "");   
	НадписьЗаказчики = ?(КоличествоЗаказчиков > 0, Лев(СтрШаблон("(%1) %2", КоличествоЗаказчиков,
		ПредставлениеЗаказчики()), 140), "все заказчики");

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЗаказчиковНаСервере()
	Возврат Объект.Заказчики.Количество();
КонецФункции

&НаСервере
Функция ПредставлениеЗаказчики()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.Заказчики Цикл
		Результат = Результат + СтрокаТЗ.Наименование + "; ";
	КонецЦикла;

	Возврат ?(Объект.ДобавленныеИсключенныеЗаказчики = 1, "Исключить: " + Результат, Результат);

КонецФункции

&НаСервере
Процедура ЗаказчикиОчиститьНаСервере()
	Объект.Заказчики.Очистить();
КонецПроцедуры

&НаСервере
Функция ЗаказчикЕстьВВыбранных(ИНН)
	СтруктураПоиск = Новый Структура("ИНН", ИНН);
	ЗаказчикВВыбранных = Объект.Заказчики.НайтиСтроки(СтруктураПоиск).Количество() > 0;

	Возврат ЗаказчикВВыбранных;
КонецФункции

#КонецОбласти

#Область НачальнаяЦена
&НаСервере
Процедура НачальнаяЦенаДоПриИзмененииНаСервере()
	Если Объект.НачальнаяЦенаОт > 0 Тогда
		Объект.НачальнаяЦенаДо = Макс(Объект.НачальнаяЦенаОт, Объект.НачальнаяЦенаДо);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НачальнаяЦенаОтПриИзмененииНаСервере()
	Если Объект.НачальнаяЦенаДо > 0 Тогда
		Объект.НачальнаяЦенаДо = Макс(Объект.НачальнаяЦенаОт, Объект.НачальнаяЦенаДо);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Площадки

&НаКлиенте
Процедура ВыборПлощадки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		ВыборПлощадкиНаСервере(РезультатЗакрытия);
		ОбновитьНадписьКоличестваПлощадок();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборПлощадкиНаСервере(ТаблицаПлощадок)
	Объект.Площадки.Очистить();
	Для Каждого СтрокаТЧ Из ТаблицаПлощадок Цикл
		НовСтр = Объект.Площадки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьНадписьКоличестваПлощадок()

	КоличествоПлощадок = ПолучитьКоличествоПлощадокНаСервере();
	//Элементы.РедактироватьПлощадки.Заголовок = "Площадки" + ?(КоличествоПлощадок > 0, " [" + КоличествоПлощадок + "]",
	//	" (все)");
	 //НадписьПлощадки = ?(КоличествоПлощадок > 0, "выбрано площадок - " + КоличествоПлощадок, "все площадки");
	НадписьПлощадки = ?(КоличествоПлощадок > 0, Лев(СтрШаблон("(%1) %2", КоличествоПлощадок, ПредставлениеПлощадок()),
		140), "все площадки");

КонецПроцедуры

&НаСервере
Функция ПредставлениеПлощадок()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.Площадки Цикл
		Результат = Результат + СтрокаТЗ.Площадка + "; ";
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьКоличествоПлощадокНаСервере()
	Возврат Объект.Площадки.Количество();
КонецФункции

&НаСервере
Функция ПолучитьТЗПлощадок()
	Возврат КонтурЗакупки_ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Площадки.Выгрузить());
КонецФункции
#КонецОбласти

#Область ОбработкиТабличнойЧастиЗакупок
&НаСервере
Процедура ЗагружатьПриИзмененииНаСервере(ИденификаторСтроки)
	СтрокаПоИдентификатору = Объект.РезультатыПоиска.НайтиПоИдентификатору(ИденификаторСтроки);
	Если СтрокаПоИдентификатору.Загружать Тогда
		НовСтрокаНаЗагрузку = Объект.ЗакупкиНаЗагрузку.Добавить();
		НовСтрокаНаЗагрузку.ИдентификаторЗакупки = СтрокаПоИдентификатору.ИдентификаторЗакупки;
	Иначе
		СтрукОтбор = Новый Структура("ИдентификаторЗакупки", СтрокаПоИдентификатору.ИдентификаторЗакупки);
		СтрокиНаУдаление = Объект.ЗакупкиНаЗагрузку.НайтиСтроки(СтрукОтбор);
		Для Каждого УдаляемаяСтрока Из СтрокиНаУдаление Цикл
			Объект.ЗакупкиНаЗагрузку.Удалить(УдаляемаяСтрока);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьКнопкиЗагрузитьЗакупки()
	НадписьГруппыКЗагрузке = "Выбрано: " + ПолучитьКоличествоЗакупокНаЗагрузку();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЗакупокНаЗагрузку()
	Возврат Объект.ЗакупкиНаЗагрузку.Количество();
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЗакупкиПоСпискуНаКлиенте()
	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"СинхронизацияНаКлиенте", Ложь);
	Если СинхронизацияНаКлиенте Тогда
		ЗагрузитьЗакупкиПоСпискуНаКлиентеФорма();
	Иначе
		ЗагрузитьЗакупкиПоСпискуНаСервереФорма();
	КонецЕсли;
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупкуПоИдентификаторуНаКлиенте(ИдентификаторЗакупки)
	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"СинхронизацияНаКлиенте", Ложь);
	Если СинхронизацияНаКлиенте Тогда
		ЗагрузитьЗакупкуПоИдентификаторуНаКлиентеФорма(ИдентификаторЗакупки);
		ОбновитьПризнакиЗагрузкиИСсылкиФорма();
	Иначе
		ЗагрузитьЗакупкуПоИдентификаторуНаСервереФорма(ИдентификаторЗакупки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупкуПоИдентификаторуНаКлиентеФорма(ИдентификаторЗакупки)
	СтруктураПараметров = Новый Структура("ИдентификаторЗакупки", ИдентификаторЗакупки);
	ФормаЗагрузки = ПолучитьФорму("Обработка.КонтурЗакупки_ДанныеЗакупки.Форма", СтруктураПараметров, ЭтаФорма);
	ФормаЗагрузки.ПолучитьДанныеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупкиПоСпискуНаКлиентеФорма()
	МассивИдентификаторовЗакупок = ПолучитьМассивИдентификаторовЗакупокНаЗагрузкуФорма();
	Для Каждого ИдентификаторЗакупки Из МассивИдентификаторовЗакупок Цикл
		ЗагрузитьЗакупкуПоИдентификаторуНаКлиенте(ИдентификаторЗакупки);
	КонецЦикла;
	ОбновитьПризнакиЗагрузкиИСсылкиФорма();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИдентификаторовЗакупокНаЗагрузкуФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМассивИдентификаторовЗакупокНаЗагрузку();
КонецФункции

&НаСервере
Процедура ЗагрузитьЗакупкиПоСпискуНаСервереФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьЗакупкиПоСписку();
	ОбработкаОбъект.ОбновитьПризнакиЗагрузкиИСсылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗакупкуПоИдентификаторуНаСервереФорма(ИдентификаторЗакупки)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьЗакупкуПоИдентификатору(ИдентификаторЗакупки);
	ОбработкаОбъект.ОбновитьПризнакиЗагрузкиИСсылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакиЗагрузкиИСсылкиФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьПризнакиЗагрузкиИСсылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры
#КонецОбласти

#Область РаботаСШаблонами

&НаКлиенте
Процедура ИзменениеШаблонаПоиска()
	ШаблонПоискаПриИзмененииНаСервере();
	ОбновитьНадписьКоличестваЗаказчиков();
	ОбновитьНадписьКоличестваОтраслей();
	ОбновитьНадписьКоличестваПлощадок();
	ОбновитьНадписьКоличестваРегионов();
	ИзменениеФлагТолькоНесостоявшиесяНаКлиенте();
	ИзменениеФлагТолькоЗавершеныНаКлиенте();
	Если Не ЗначениеЗаполнено(Объект.ШаблонПоиска) Тогда
		НачальноеЗаполнениеПризнаков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныСохранитьНаКлиенте()
	Если Не ЗначениеЗаполнено(Объект.ШаблонПоиска) Тогда
		НазваниеШаблона = "";
		ОповещениеОкончниеВводаНазванияШаблона = Новый ОписаниеОповещения("ОкончниеВводаНазванияШаблона", ЭтаФорма);
		ПоказатьВводСтроки(ОповещениеОкончниеВводаНазванияШаблона, НазваниеШаблона, "Введите название шаблона", 150);
	Иначе
		ШаблоныСохранитьНаСервере();
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОкончниеВводаНазванияШаблона(ВведеннаяСтрока, ДополнительныеПараметры) Экспорт
	Если Не ПустаяСтрока(ВведеннаяСтрока) Тогда
		ШаблоныСохранитьНаСервере(ВведеннаяСтрока);
		Модифицированность = Ложь;
	Иначе
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru='Пустое наименование шаблона.
			 |Шаблон не сохранен'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ШаблоныСохранитьНаСервере(НазваниеШаблона = "")
	Если ЗначениеЗаполнено(Объект.ШаблонПоиска) Тогда
		СпрШаблон = Объект.ШаблонПоиска.ПолучитьОбъект();
	Иначе
		СпрШаблон = Справочники.КонтурЗакупки_ШаблоныПоиска.СоздатьЭлемент();
		СпрШаблон.Наименование = НазваниеШаблона;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(СпрШаблон, Объект);
	СпрШаблон.ТипТорговКоммерческиеИМалые = Объект.ТипТорговКоммерческие И Объект.ТипТорговМалые;
	СпрШаблон.Заказчики.Загрузить(Объект.Заказчики.Выгрузить());
	СпрШаблон.Площадки.Загрузить(Объект.Площадки.Выгрузить());
	СпрШаблон.Регионы.Загрузить(Объект.Регионы.Выгрузить());
	СпрШаблон.Отрасли.Загрузить(Объект.Отрасли.Выгрузить());
	СпрШаблон.ОтраслиОбновленные.Загрузить(Объект.ОтраслиОбновленные.Выгрузить());

	СпрШаблон.Записать();

	Объект.ШаблонПоиска = СпрШаблон.Ссылка;

	ТекущийПользователь = КонтурЗакупки_ЛокализацияВызовСервера.ПолучитьТекущегоПользователя();
	Если Не ТекущийПользователь = Неопределено Тогда
		КонтурЗакупки_ЛокализацияВызовСервера.УстановитьОтветственного(СпрШаблон.Ссылка, ТекущийПользователь);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура НачальноеЗаполнениеПризнаков()

	Объект.ЭтапПодачаЗаявок = Истина;

	Объект.ТипТоргов223ФЗ = Истина;
	Объект.ТипТоргов44ФЗ = Истина;
	Объект.ТипТоргов615ПП = Истина;
	Объект.ТипТорговКоммерческие = Истина;
//	Объект.ТипТорговКоммерческиеИМалые = Истина;
	Объект.ТипТорговМалые = Истина;

	Объект.СпособОтбораЭлектронныйАукцион = Истина;
	Объект.СпособОтбораЗапросКотировок = Истина;
	Объект.СпособОтбораЗакупкаУЕдинственногоПоставщика = Истина;
	Объект.СпособОтбораКонкурс = Истина;
	Объект.СпособОтбораЗапросИлиМониторингЦен = Истина;
	Объект.СпособОтбораДругиеСпособы = Истина;
	Объект.СпособОтбораВсе = Истина;

КонецПроцедуры

&НаСервере
Процедура ШаблонПоискаПриИзмененииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьПоискПоШаблону();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

#КонецОбласти

#Область ОтметкиОЗагрузке

&НаСервере
Процедура ОтметитьЗакупкиНеЗагруженныеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.РезультатыПоиска Цикл
		Если Не СтрокаТЧ.Загружен Тогда
			СтрокаТЧ.Загружать = Истина;
			НовСтрокаНаЗагрузку = Объект.ЗакупкиНаЗагрузку.Добавить();
			НовСтрокаНаЗагрузку.ИдентификаторЗакупки = СтрокаТЧ.ИдентификаторЗакупки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ОтметитьЗакупкиВсеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.РезультатыПоиска Цикл
		СтрокаТЧ.Загружать = Истина;
		НовСтрокаНаЗагрузку = Объект.ЗакупкиНаЗагрузку.Добавить();
		НовСтрокаНаЗагрузку.ИдентификаторЗакупки = СтрокаТЧ.ИдентификаторЗакупки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкиЗакупкиВсеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.РезультатыПоиска Цикл
		СтрокаТЧ.Загружать = Ложь;
	КонецЦикла;
	Объект.ЗакупкиНаЗагрузку.Очистить();
КонецПроцедуры
&НаКлиенте
Процедура ОповещениеОкончанияВопросаОЗагрузке(РезультатВопроса, ИдентификаторЗакупки) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьЗакупкуПоИдентификаторуНаКлиенте(ИдентификаторЗакупки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#КонецОбласти
